
#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

// Соя Б 13000 45
// Чумиза 3 8000 17
// Рис З 25650 24
// Вводити інформацію через "space"/"jump bar". 

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	char name1[9] = "Соя", name2[13] = "Чумиза", name3[9] = "Рис"; 
	char sc1 = 'Б', sc2 = 'З', sc3 = 'З';
	int cnt1 = 13000, cnt2 = 8000, cnt3 = 25650;
	float sq1 = 45, sq2 = 17, sq3 = 24;

	printf("1. Введіть: найменування, тип , посівна площа (га) , врожайність (ц/га) >");

	scanf("%s %c %d %f", name1, &sc1, &cnt1, &sq1);

	printf("2. Введіть: найменування, тип , посівна площа (га) , врожайність (ц/га) >");

	scanf("%s %c %d %f", name2, &sc2, &cnt2, &sq2);

	printf("3. Введіть: найменування, тип , посівна площа (га) , врожайність (ц/га) >");

	scanf("%s %c %d %f", name3, &sc3, &cnt3, &sq3);

	printf("|--------------------------------------------------------------|\n");
	printf("|Сільськогосподарські культури                                 |\n");
	printf("|--------------------------------------------------------------|\n");
	printf("| Найменування | Тип  | Посівна площа (га) | Врожайність (ц/га)|\n");
	printf("|--------------|------|-------------------|--------------------|\n");
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name1, sc1, cnt1, sq1);
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name2, sc2, cnt2, sq2);
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name3, sc3, cnt3, sq3);
	printf("|--------------------------------------------------------------|\n");
	printf("| Примітка: З – зернові, Б – бобові                            |\n");
	printf("|--------------------------------------------------------------|\n");
	return 0;
}
