
#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

// RT-11-24 R 100000 12 
// RT-11-24 R 50000 10
// CGU-12K C 17.5 3
// Вводити інформацію через "space"/"jump bar". 

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	char name1[9] = "RT-11-24", name2[13] = "RT-11-24", name3[9] = "CGU-12K"; 
	char sc1 = 'R', sc2 = 'R', sc3 = 'C';
	int cnt1 = 100000, cnt2 = 50000, cnt3 = 17.5;
	float sq1 = 12, sq2 = 10, sq3 = 3;

	printf("1. Введіть: позначення, тип , номінал , кількість >");

	scanf("%s %c %d %f", name1, &sc1, &cnt1, &sq1);

	printf("2. Введіть: позначення, тип , номінал , кількість >");

	scanf("%s %c %d %f", name2, &sc2, &cnt2, &sq2);

	printf("3. Введіть: позначення, тип , номінал , кількість >");

	scanf("%s %c %d %c", name3, &sc3, &cnt3, &sq3);

	printf("|--------------------------------------------------------------|\n");
	printf("|Відомість комплектуючих                                       |\n");
	printf("|--------------------------------------------------------------|\n");
	printf("| Позначення   | Тип  | Номінал           | Кількість          |\n");
	printf("|--------------|------|-------------------|--------------------|\n");
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name1, sc1, cnt1, sq1);
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name2, sc2, cnt2, sq2);
	printf("| %8s     | %5c|%10d         | %-11.1f        |\n", name3, sc3, cnt3, sq3);
	printf("|--------------------------------------------------------------|\n");
	printf("| Примітка: R – резистор; C – конденсатор                      |\n");
	printf("|--------------------------------------------------------------|\n");
	return 0;
}
